[
    {
        "id": "0",
        "title": "Yolo_based_Approach_for_Fire_and_Smoke_Detection",
        "imageUrl": "/posts/link1.jpg",
        "postUrl": "https://ftp.saiconference.com/Downloads/Volume15No1/Paper_9-A_Yolo_based_Approach_for_Fire_and_Smoke_Detection.pdf",
        "summary": "Возможности наблюдения в Интернете вещей (IoT) системы для отслеживания и анализа данных в режиме реального времени для широкого спектра Приложения привлекли большой интерес в последние годы. Одним из таких применений является обнаружение огня и дыма в больницах, где быстрые действия необходимы, чтобы избежать материального ущерба и человеческие жертвы."
    },
    {
        "id":"1",
        "title": "Fire and Smoke Detection Using Fine-Tuned YOLOv8 and YOLOv7 Deep Models",
        "imageUrl": "/posts/link2.jpg",
        "postUrl": "https://www.mdpi.com/2571-6255/7/4/135",
        "summary": "Лесные пожары, рассматриваемые как значительное стихийное бедствие, представляют серьезную угрозу для человеческих сообществ, дикой природы и лесных экосистем. Частота возникновения лесных пожаров в последнее время возросла, при этом решающую роль играют последствия глобального потепления и взаимодействие человека с окружающей средой. Решение этой проблемы требует от пожарных способности оперативно определять пожары на основе ранних признаков дыма, что позволяет им вмешиваться и предотвращать дальнейшее распространение. "
    },
    {
        "id":"2",
        "title": "Fire Detection From Image and Video Using YOLOv5",
        "imageUrl": "/posts/link3.jpg",
        "postUrl": "https://arxiv.org/pdf/2310.06351",
        "summary": "Для обнаружения целей, похожих на огонь, на изображениях внутренних, наружных и лесных пожаров, а также обнаружения пожаров при различном естественном освещении предлагается улучшенный алгоритм глубокого обучения обнаружения пожаров YOLOv5. Модель обнаружения YOLOv5 расширяет сеть извлечения признаков из трех измерений, что улучшает распространение признаков идентификации мелких целей пожара, повышает производительность сети и снижает параметры модели. Кроме того,благодаря продвижению пирамиды признаков получается наиболее эффективный блок прогнозирования."
    },
    {
        "id":"3",
        "title": "Using Popular Object Detection Methods for Real Time Forest Fire Detection",
        "imageUrl": "/posts/link4.jpg",
        "postUrl": "https://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8695482",
        "summary": "В этой статье мы сосредоточимся на трех проблемах, которые окружают обнаружение лесных пожаров, в реальном времени, раннее обнаружение пожаров и ложное обнаружение. Впервые мы используем классические методы объективного обнаружения для обнаружения лесных пожаров: более быстрый R-CNN, YOLO (tiny-yolo-voc, tiny-yolo-voc1, yolo-voc.2.0 и yolov3) и SSD, среди которых SSD имеет лучшие свойства в реальном времени, более высокую точность обнаружения и способность раннего обнаружения пожаров. Мы проводим бенчмаркинг пожаров и дыма, используем новый добавленный класс дыма и изменения области пожара, чтобы минимизировать неправильное обнаружение."
    },
    {
        "id":"4",
        "title": "A lightweight fire detection algorithm for small targets based on YOLOv5s",
        "imageUrl": "/posts/link5.jpg",
        "postUrl": "https://www.nature.com/articles/s41598-024-64934-4",
        "summary": "В ответ на текущие проблемы, с которыми сталкиваются алгоритмы обнаружения пожара, включая низкую точность обнаружения и ограниченные показатели распознавания небольших целей пожара в сложных условиях, мы представляем облегченный алгоритм обнаружения пожара на основе улучшенного YOLOv5s. Внедрение структуры CoT в магистральную нейронную сеть, а также создание нового модуля CSP1_CoT эффективно сократило количество параметров модели, одновременно улучшая возможности извлечения и слияния признаков магистральной сети; Архитектура Neck сети была расширена за счет введения специального слоя обнаружения, предназначенного для небольших целей, и включения механизма внимания SE. "
    },
    {
        "id":"5",
        "title": "Fire Detection from scratch using YOLOv3",
        "imageUrl": "/posts/link6.jpg",
        "postUrl": "https://medium.com/@b117020/fire-detection-using-neural-networks-4d52c5cd55c5",
        "summary": "You only look once (YOLO) — это современный алгоритм обнаружения объектов в реальном времени. На Pascal Titan X он обрабатывает изображения со скоростью 30 кадров в секунду и имеет mAP 57,9% на COCO test-dev. Он быстрый и точный, и достигается простой компромисс между скоростью и точностью на основе размера модели, который можно соответствующим образом изменить. Для извлечения признаков YOLO версии 3 использует 53-слойную архитектуру сверточной нейронной сети с последовательными 3 x 3 и 1 x 1 сверточными слоями. Для целей обнаружения к нему добавляются еще 53 слоя, что дает 106-слойную сверточную архитектуру для YOLO v3. Структура сетевой архитектуры называется Darknet-53."
    },
    {
        "id":"6",
        "title": "Fire detection and identification method based on improved YOLOv3",
        "imageUrl": "/posts/link7.jpg",
        "postUrl": "https://patents.google.com/patent/CN112884090A/en",
        "summary": "Изобретение обеспечивает новый метод обнаружения идентификации пожара YOLOv3-CA на основе улучшенного алгоритма YOLOv3, нацеленного на проблемы, связанные с тем, что традиционный метод обнаружения пожара имеет низкую скорость идентификации, длительное время обнаружения, неспособен к мониторингу в реальном времени и т. п. YOLOv3-CA добавляет модуль механизма внимания в модуль свертки сети на основе базовой структуры YOLOv3 для повышения эффекта извлечения признаков. И, кроме того, вводится адаптивный метод пространственного слияния признаков для более полного использования семантической информации высокоуровневых признаков и мелкозернистых признаков нижнего уровня. "
    },
    {
        "id":"7",
        "title": "EMG-YOLO: An efficient fire detection model for embedded devices",
        "imageUrl": "/posts/link8.jpg",
        "postUrl": "https://www.sciencedirect.com/science/article/abs/pii/S1051200424004494",
        "summary": "Количество встроенных периферийных устройств увеличивается с развитием технологии Интернета вещей (IoT). В городском пожарообнаружении повышение точности обнаружения пожара на основе встроенных устройств требует значительных вычислительных ресурсов, что усугубляет конфликт между высокой точностью, необходимой для обнаружения пожара, и низкими вычислительными возможностями многих встроенных устройств. Для решения этой проблемы в данной статье представлен алгоритм обнаружения пожара под названием EMG-YOLO. Цель состоит в том, чтобы повысить точность и эффективность обнаружения пожара на встроенных устройствах с ограниченными вычислительными ресурсами."
    },
    {
        "id":"8",
        "title": "Forest fire detection algorithm based on Improved YOLOv5",
        "imageUrl": "/posts/link9.jpg",
        "postUrl": "https://iopscience.iop.org/article/10.1088/1742-6596/2384/1/012046/pdf",
        "summary": "Нацелившись на проблему, заключающуюся в том, что существующие алгоритмы обнаружения целей затрудняют обнаружение внезапного пожара с высокой точностью в режиме реального времени в сложной лесной среде, мы предлагаем улучшенный алгоритм обнаружения лесных пожаров на основе YOLOv5. Во-первых, алгоритм кластеризации k-средних на основе расстояния 1-IoU используется для предварительной обработки набора данных о лесных пожарах. Во-вторых, механизм внимания Transformer добавляется в модельную магистральную сеть для повышения точности обнаружения, а функция потерь регрессионного блока GIoU-NMS изменяется на EIoU-NMS. Наконец, структура сети изменяется, и добавляется глубокая разделимая свертка для уменьшения параметров."
    }
]